2022-2023/Machine Learning/1.lecture-introductions.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-08-10 mer. 15:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Machine Learning</title>
<meta name="author" content="Jay Morgan" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Machine Learning
<br />
<span class="subtitle">Lecture 1 - Introductions</span>
</h1>

<div id="outline-container-orgc31576f" class="outline-2">
<h2 id="orgc31576f">Introduction</h2>
<div class="outline-text-2" id="text-orgc31576f">
</div>
<div id="outline-container-orgf977942" class="outline-3">
<h3 id="orgf977942">Course Organisation</h3>
<div class="outline-text-3" id="text-orgf977942">
</div>
<div id="outline-container-orgb192d92" class="outline-4">
<h4 id="orgb192d92">Welcome!</h4>
<div class="outline-text-4" id="text-orgb192d92">
<p>
Welcome to all the new students! Here I am going to be talking about Machine Learning
and all of the great things that this "technology" has to offer. To begin our course,
I shall start with a bit of house keeping &#x2013; more specifically, I will be talking
about what exactly we'll be learning about in the course (Machine Learning is a broad
subject after-all). In addition, I will tell you where you can find the resources
related to the course and how you can contact me, should you have any questions.
</p>
</div>
</div>

<div id="outline-container-org1616b3e" class="outline-4">
<h4 id="org1616b3e">What this course is about?</h4>
<div class="outline-text-4" id="text-org1616b3e">
<p>
In this course, we will be learning about Machine Learning: firstly, what Machine
Learning actually is; secondly, we'll take a look at some of the algorithms within
the scope of Machine Learning, and develop an intuition about how these algorithms
work and when they would be useful; and finally, how we can compare and evaluate the
algorithms we've learnt about.
</p>
</div>
</div>

<div id="outline-container-org0f556ea" class="outline-4">
<h4 id="org0f556ea">How this course will be taught</h4>
<div class="outline-text-4" id="text-org0f556ea">
<p>
I intended to deliver this course via a series of lectures. These lectures will be
accompanied by the PDF lecture slides, in which I will provide the definitions and
provide reference links should you wish to do some extra reading.
</p>
</div>
</div>

<div id="outline-container-org8be7547" class="outline-4">
<h4 id="org8be7547">Outline of the course</h4>
<div class="outline-text-4" id="text-org8be7547">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Lecture</th>
<th scope="col" class="org-left">Expected date</th>
<th scope="col" class="org-left">Length</th>
<th scope="col" class="org-left">Topic</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">NOW</td>
<td class="org-left">2 hours</td>
<td class="org-left">Introduction</td>
</tr>

<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-orga0d9e0c" class="outline-3">
<h3 id="orga0d9e0c">Reading the lectures</h3>
<div class="outline-text-3" id="text-orga0d9e0c">
</div>
<div id="outline-container-org0f4ab60" class="outline-4">
<h4 id="org0f4ab60">Source code</h4>
<div class="outline-text-4" id="text-org0f4ab60">
<p>
During the course, I would also like to supplement my algorithmic definitions and
explanations with some programming code &#x2013; for this I will use the <a href="https://julialang.org/">Julia</a> programming
language. The code snippets would look something like:
</p>

<div class="org-src-container">
<pre class="src src-julia">x = Float32.([1, 2, 3, 4]);
y = x .+ randn(length(x))
</pre>
</div>

<pre class="example">
4-element Vector{Float64}:
 1.8817576050704024
 2.051062476034138
 4.340649570113399
 3.1284623590241476
</pre>
</div>
</div>

<div id="outline-container-org2ddcaa9" class="outline-4">
<h4 id="org2ddcaa9">References</h4>
<div class="outline-text-4" id="text-org2ddcaa9">
<p>
In some cases, and is the norm with academic traditions, we'll want to include a
reference, a link to previous written works.
</p>

<p>
Here is an example of a sentence that includes a reference:
</p>

<p>
"This is a very important sentence which I assert to be true, to convince you of this
fact I shall appeal to authority and include a reference:
(Shalev-Shwartz, Shai and Ben-David, Shai, 2014)"
</p>

<p>
More information on the referenced material (such as title, publishing date) will be
found in the bibliography slide (or bottom of the webpage if you're viewing the HTML
version of the lectures).
</p>
</div>
</div>

<div id="outline-container-orgb505d17" class="outline-4">
<h4 id="orgb505d17">About Me</h4>
<div class="outline-text-4" id="text-orgb505d17">
<p>
My name is Dr Jay Morgan. I am a researcher at the Université de Toulon, where I am
developing Deep Learning models (a sub-field of Machine Learning research) for the
study of astrophysical phenomenon.
</p>

<p>
You can find more information and links on my personal (LIS-Lab) website:
<a href="https://pageperso.lis-lab.fr/jay.morgan/">https://pageperso.lis-lab.fr/jay.morgan/</a>
</p>

<p>
I also publish libraries and source code online:
</p>
<ul class="org-ul">
<li>Github: <a href="https://github.com/jaypmorgan">https://github.com/jaypmorgan</a></li>
<li>Gitlab: <a href="https://gitlab.com/jaymorgan">https://gitlab.com/jaymorgan</a></li>
<li>Source Hut: <a href="https://sr.ht/~jaymorgan/">https://sr.ht/~jaymorgan/</a></li>
</ul>

<p>
If you have any questions, you can email me at jay.morgan@univ-tln.fr
</p>
</div>
</div>

<div id="outline-container-org39efc58" class="outline-4">
<h4 id="org39efc58">Where you can find the resources</h4>
<div class="outline-text-4" id="text-org39efc58">
<p>
I try to make this course as accessible as possible, which means that I host these
slides in a variety of ways to suit you.
</p>

<p>
Firstly, you can find the links to all my courses on my personal website at:
<a href="https://pageperso.lis-lab.fr/jay.morgan/teaching.html">https://pageperso.lis-lab.fr/jay.morgan/teaching.html</a>
</p>

<p>
Here you can find the links to each lecture in a PDF or HTML format. Additionally,
you can view the source code used to make these lectures on source hut:
<a href="https://git.sr.ht/~jaymorgan/teaching">https://git.sr.ht/~jaymorgan/teaching</a>. On this git repository you can find all my
lectures from all years.
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-org6abe8f6" class="outline-2">
<h2 id="org6abe8f6">What is learning, anyway?</h2>
<div class="outline-text-2" id="text-org6abe8f6">
</div>
<div id="outline-container-orgeccd6fc" class="outline-3">
<h3 id="orgeccd6fc">Learning about Learning</h3>
<div class="outline-text-3" id="text-orgeccd6fc">
</div>
<div id="outline-container-org6f97938" class="outline-4">
<h4 id="org6f97938">Let's answer the question of learning</h4>
<div class="outline-text-4" id="text-org6f97938">
<p>
We'll begin our journey into the world of Machine Learning by tackling the question
of what it means to 'learn' &#x2013; how may a machine actually <i>learn</i> anything?
</p>
</div>
</div>

<div id="outline-container-orgfc0eee6" class="outline-4">
<h4 id="orgfc0eee6">Study of Mice</h4>
<div class="outline-text-4" id="text-orgfc0eee6">
<p>
To begin to answer the question of learning, we may turn to nature for
advice. Principally, if we look at the studies conducted with Mice we find some idea
to notion of learning (Shalev-Shwartz, Shai and Ben-David, Shai, 2014).
</p>
</div>
</div>

<div id="outline-container-org6ecaedc" class="outline-4">
<h4 id="org6ecaedc">Bait-shyness</h4>
<div class="outline-text-4" id="text-org6ecaedc">
<p>
When a rat encounters a novel source of food, it will first eat a little bit of
it. If the food is edible for the rat, it will continue to eat the food, even in
future encounters. If, however, on the initial contact with the food, the rat deems
the food poisonous, it will ignore and not eat the food in future encounters. This
process we call 'bait-shyness'.
</p>

<p>
Here then we see the rat, on finding something new, learn from its experience, and
use that knowledge of the experience for future encounters.
</p>
</div>
</div>
