2022-2023/Machine Learning/1.lecture-introductions.html

<div id="outline-container-org8e8451e" class="outline-4">
<h4 id="org8e8451e">Bait-shyness</h4>
<div class="outline-text-4" id="text-org8e8451e">
<p>
Our initial understanding of rat's bait-shyness was limited, but we've come to
understand more about it. For instance, we learn that their learning process is more
complex than originally thought. In a later experiment, where the 'poison' in the
food is replaced by a different unpleasant stimulus such as a electric shock &#x2013;
i.e. when a rat eats a food, it is then shocked. It was found that this did not
deter the rat from eating the food in future encounters, unlike the poison.
</p>

<p>
It is presumed that the rat's have some 'prior knowledge' about the world and do not
infer a temporal relationship between the food and being shocked, while they can
infer the same relationship with food and illness.
</p>
</div>
</div>

<div id="outline-container-orge7e9ae7" class="outline-4">
<h4 id="orge7e9ae7">Computer Programs</h4>
<div class="outline-text-4" id="text-orge7e9ae7">
<p>
From these two examples of how rats may learn we see: the rat will make a guess about
something now (i.e. that the food is not poisonous), it will find out how good this
guess is (i.e. it either gets ill or it does not), and learn from how well its guess
was for the future. We also see that its learning can be impacted by the rat's prior
knowledge about how the world may work.
</p>

<p>
But how does this <i>framework</i> for the process of learning translate to computers? For a
more formal definition of how computer programs could be said to learn, we have a
similar idea:
</p>

<blockquote>
<p>
A computer program is said to learn from experience \(E\) with respect
to some class of tasks \(T\) and performance measure \(P\), if its performance
a tasks in \(T\), as measured by \(P\), improves with experience \(E\).
</p>
</blockquote>

<p>
(Mitchell, Tom M, 1997)
</p>
</div>
</div>

<div id="outline-container-orgcf21b11" class="outline-4">
<h4 id="orgcf21b11">When might we need Machine Learning</h4>
<div class="outline-text-4" id="text-orgcf21b11">
<p>
Why do we need computer programs that 'learn' anyway? We already have programming
languages, why can't we just use them?
</p>

<p>
Let's suppose we're creating a very simple Optical Character Recognition (OCR)
program. This program looks at a PDF document and converts the text into something we
can copy and paste. Part of this program's task is to take an individual character,
say the number '8', and recognise that it's an 8 and add that to the already scanned
text.
</p>

<p>
How would we go about creating a program where we can define how to identify '8' or
'1' or 'l' &#x2013; with all the varieties of lighting conditions, handwriting, fonts,
sizes. We could find the process of encompassing all different variations tiresome &#x2013;
if not impossible, and that's only for a single character!
</p>
</div>
</div>

<div id="outline-container-org12875d2" class="outline-4">
<h4 id="org12875d2">When might we need Machine Learning</h4>
<div class="outline-text-4" id="text-org12875d2">
<p>
With Machine Learning, instead of enumerating all possible solutions within a
programming language, we collect a bunch of examples of '8's and give them to the
algorithm to learn from.
</p>

<p>
Through looking at these many different examples, the algorithm will/should be able
to recognise what an 8 generally looks like.
</p>
</div>
</div>

<div id="outline-container-org4bec62f" class="outline-4">
<h4 id="org4bec62f">Different types of Learning</h4>
<div class="outline-text-4" id="text-org4bec62f">
<p>
What we have just demonstrated by way of the OCR example, is the type of learning we
call 'Supervised Learning'. We have many examples of input (lots of different kinds
of handwritten 8's), and we tell the learning algorithm, that they are indeed the
number 8.
</p>

<p>
But there are other kind of different learning frameworks. Specifically we have the
following:
</p>

<ul class="org-ul">
<li>Supervised Learning</li>
<li>Unsupervised, or sometimes called self-supervised Learning</li>
<li>Reinforcement Learning</li>
</ul>
</div>
</div>

<div id="outline-container-org61b0152" class="outline-4">
<h4 id="org61b0152">Supervised Learning</h4>
<div class="outline-text-4" id="text-org61b0152">
<p>
To better formalise Supervised Learning from our previous OCR example, Supervised
Learning is when the learning algorithm "see's" or has access to both the input and
output.
</p>

<p>
Let's have a dataset \(X\), which is a set consisting of tuple pairs \(x_i, y_i\). \(x_i£\)
is an input, i.e. a single image with an '8', and \(y_i\) is a label which tells the
learning algorithm if the input is indeed an '8' or something else. Mathematically we have:
</p>

<p>
\(X = \{(x_1, y_1), (x_2, y_2), ..., (x_n, y_n)\}\)
</p>
</div>
</div>

<div id="outline-container-org1720f97" class="outline-4">
<h4 id="org1720f97">Unsupervised Learning</h4>
<div class="outline-text-4" id="text-org1720f97">
<p>
In Unsupervised learning, we have again have a dataset \(X\), who's elements are only
inputs. In other words, there are no corresponding labels for each input. Instead,
the learning algorithm must learn inherent patterns in the data and create labels
itself. Throughout the course, we'll see examples of Unsupervised Learning in action.
</p>

<p>
One thing to note: Recent methodologies have started to call Unsupervised Learning,
self-supervised. As we have just discussed, the labels are inherent to the data from
the discovered patterns, it's just we are not explicitly giving them to the learning
algorithm ourselves. So it's sort of like a supervised learning setup, except the
learning algorithm is providing the labels itself &#x2013; hence the self-supervised.
</p>
</div>
</div>

<div id="outline-container-org1eb7907" class="outline-4">
<h4 id="org1eb7907">Reinforcement Learning</h4>
<div class="outline-text-4" id="text-org1eb7907">
<p>
Reinforcement Learning is very different to both Supervised and Unsupervised
Learning. Here is the type of learning you might be familiar with if you've seen 'AI'
that learns to play video games. In this type of learning, we have the following
elements:
</p>

<ul class="org-ul">
<li>An agent</li>
<li>An environment</li>
<li>A set of allowed actions the agent can make within its environment.</li>
</ul>

<p>
In this situation, an agent will interact with it's environment, and when it does
something it can receive a reward (a reward can be positive or negative). The agent
will remember what it has done to receive the reward. The objective for the agent is
to maximise the reward score, and learns to do this through many iterations or
play-through.
</p>
</div>
</div>
</div>

<div id="outline-container-org999be0a" class="outline-3">
<h3 id="org999be0a">Terminology</h3>
<div class="outline-text-3" id="text-org999be0a">
</div>
<div id="outline-container-org8476a2a" class="outline-4">
<h4 id="org8476a2a">What will our data look like?</h4>
<div class="outline-text-4" id="text-org8476a2a">
<p>
Data in Machine Learning applications can come in a variety of different formats. The
most typical data formats we might see are:
</p>

<ul class="org-ul">
<li>Tables</li>
<li>Images/Videos</li>
<li>Text</li>
<li>Sound</li>
</ul>

<p>
These are the initial formats, though, before actually doing any learning, we will
want to transform them into a different representation that we can use.
</p>
</div>
</div>

<div id="outline-container-org3a5f572" class="outline-4">
<h4 id="org3a5f572">Tables</h4>
<div class="outline-text-4" id="text-org3a5f572">
<p>
A table, or tabular, format is a \(n \times m\) set of data with \(n\) samples or
examples, and \(m\) features for each sample. For example, suppose we have a table
consisting the price of 100 different houses:
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Number of bedrooms</th>
<th scope="col" class="org-right">Garden size (ft)</th>
<th scope="col" class="org-left">&#x2026;</th>
<th scope="col" class="org-left">Price ($)</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">3</td>
<td class="org-right">0</td>
<td class="org-left">&#x2026;</td>
<td class="org-left">150,000</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-right">10</td>
<td class="org-left">&#x2026;</td>
<td class="org-left">200,000</td>
</tr>

<tr>
<td class="org-right">&#x2026;</td>
<td class="org-right">&#x2026;</td>
<td class="org-left">&#x2026;</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-right">1000</td>
<td class="org-left">&#x2026;</td>
<td class="org-left">2,000,000</td>
</tr>
</tbody>
</table>

<p>
In a supervised learning setting, where we want to predict the price of a house we may then have the following dataset:
</p>

<p>
\(X = \{([3, 0, ...], 150,000), ([5, 10, ...], 200,000), \\..., ([10, 1000, ...], 2,000,000)\}\)
</p>
</div>
</div>
