2022-2023/Machine Learning/1.lecture-introductions.org
*** Images/Videos

Images are composed of 2D or 3D arrays of numeric values. For example, in a RGB
image that is 1024x500 pixels, we would have the array of size 1024x500x3 -- where 3
is the red, green, and blue channel, respectively. If we have just a grayscale image,
we could represent it as either 1024x500x1 or 1024x500 as the channel 'dimension' of
the array is singular.

We may already know that videos are simply a sequence of images that are iterated
through 24+ times a second. For a 24 frames per second video, we would have an array
size of 1024x500x3x24 -- a 4-dimensional array.

*** Text

- Composition of words
- Can be in order, but doesn't have to be!
- What is considered a word?

*** Time-series

- Sequence of values (vector with a time component)
- Example is a sound wave.

*** Inputs/Outputs

Within our data, each value will take on a certain type.

| Name        | Example                     |
|-------------+-----------------------------|
| Discrete    | Total number of students    |
| Continuious | Height of a student         |
|-------------+-----------------------------|
| Ordinal     | element of {Low, Med, High} |
| Nominal     | element of {'dog', 'cat'}   |

- Discrete:
- Continuious:
- Ordinal: 
- Nominal:

*** Types of Outputs -- Regression & Classification

- Regression - to continuious
- Classification to discrete

** Example Problems

*** Boston House Prices Dataset -- Tabular Regression

#+begin_src julia  :results output :session :exports both
using DataFrames
using MLDatasets: BostonHousing
dataset = BostonHousing();
dataset[1:5]
#+end_src

#+RESULTS:
#+begin_example
(features = 5×13 DataFrame
 Row │ CRIM     ZN       INDUS    CHAS   NOX      RM       AGE      DIS      RAD    TAX    PTRATIO  B        LSTAT   
     │ Float64  Float64  Float64  Int64  Float64  Float64  Float64  Float64  Int64  Int64  Float64  Float64  Float64 
─────┼────────────────────────────────────────────────────────────────────────────────────────────────────────────────
   1 │ 0.00632     18.0     2.31      0    0.538    6.575     65.2   4.09        1    296     15.3   396.9      4.98 
   2 │ 0.02731      0.0     7.07      0    0.469    6.421     78.9   4.9671      2    242     17.8   396.9      9.14
   3 │ 0.02729      0.0     7.07      0    0.469    7.185     61.1   4.9671      2    242     17.8   392.83     4.03
   4 │ 0.03237      0.0     2.18      0    0.458    6.998     45.8   6.0622      3    222     18.7   394.63     2.94
   5 │ 0.06905      0.0     2.18      0    0.458    7.147     54.2   6.0622      3    222     18.7   396.9      5.33 , targets = 5×1 DataFrame
 Row │ MEDV
     │ Float64
─────┼─────────
   1 │    24.0
   2 │    21.6
   3 │    34.7
   4 │    33.4
   5 │    36.2)
#+end_example

*** Iris Dataset -- Tabular Classification

#+begin_src julia
using MLDatasets: Iris
dataset = Iris();
dataset[1:5]
#+end_src

#+RESULTS:
#+begin_example
(features = 5×4 DataFrame
 Row │ sepallength  sepalwidth  petallength  petalwidth
     │ Float64      Float64     Float64      Float64
─────┼──────────────────────────────────────────────────
   1 │         5.1         3.5          1.4         0.2
   2 │         4.9         3.0          1.4         0.2
   3 │         4.7         3.2          1.3         0.2
   4 │         4.6         3.1          1.5         0.2
   5 │         5.0         3.6          1.4         0.2, targets = 5×1 DataFrame
 Row │ class
     │ String15
─────┼─────────────
   1 │ Iris-setosa
   2 │ Iris-setosa
   3 │ Iris-setosa
   4 │ Iris-setosa
   5 │ Iris-setosa)
#+end_example

*** MNIST Dataset -- Image Classification

#+begin_src julia
using MLDatasets: MNIST
dataset = MNIST();
dataset[1:5]
#+end_src

#+RESULTS:
: (features = [0.0 0.0 … 0.0 0.0; 0.0 0.0 … 0.0 0.0; … ; 0.0 0.0 … 0.0 0.0; 0.0 0.0 … 0.0 0.0;;; 0.0 0.0 … 0.0 0.0; 0.0 0.0 … 0.0 0.0; … ; 0.0 0.0 … 0.0 0.0; 0.0 0.0 … 0.0 0.0;;; 0.0 0.0 … 0.0 0.0; 0.0 0.0 … 0.0 0.0; … ; 0.0 0.0 … 0.0 0.0; 0.0 0.0 … 0.0 0.0;;; 0.0 0.0 … 0.0 0.0; 0.0 0.0 … 0.0 0.0; … ; 0.0 0.0 … 0.0 0.0; 0.0 0.0 … 0.0 0.0;;; 0.0 0.0 … 0.0 0.0; 0.0 0.0 … 0.0 0.0; … ; 0.0 0.0 … 0.0 0.0; 0.0 0.0 … 0.0 0.0], targets = [5, 0, 4, 1, 9])

*** MNIST Dataset -- Image Classification

#+begin_src julia
using Plots
p = heatmap(dataset[1].features', yflip=true, colorbar=false)
p = title!("Label/Target: $(dataset[1].targets)")
savefig(p, "images/mnist-example.png")
#+end_src

#+RESULTS:
#+begin_example



ERROR: SystemError: opening file "/home/jaymorgan/Nextcloud/Teaching/images/mnist-example.png": Aucun fichier ou dossier de ce type
Stacktrace:
  [1] systemerror(p::String, errno::Int32; extrainfo::Nothing)
    @ Base ./error.jl:174
  [2] #systemerror#68
    @ ./error.jl:173 [inlined]
  [3] systemerror
    @ ./error.jl:173 [inlined]
  [4] open(fname::String; lock::Bool, read::Nothing, write::Nothing, create::Nothing, truncate::Bool, append::Nothing)
    @ Base ./iostream.jl:293
  [5] open(fname::String, mode::String; lock::Bool)
    @ Base ./iostream.jl:355
  [6] open(fname::String, mode::String)
    @ Base ./iostream.jl:355
  [7] open(::Plots.var"#277#278"{Plots.Plot{Plots.GRBackend}}, ::String, ::Vararg{String}; kwargs::Base.Pairs{Symbol, Union{}, Tuple{}, NamedTuple{(), Tuple{}}})
    @ Base ./io.jl:328
  [8] open
    @ ./io.jl:328 [inlined]
  [9] png(plt::Plots.Plot{Plots.GRBackend}, fn::String)
    @ Plots ~/.julia/packages/Plots/SkUg1/src/output.jl:4
 [10] savefig(plt::Plots.Plot{Plots.GRBackend}, fn::String)
    @ Plots ~/.julia/packages/Plots/SkUg1/src/output.jl:115
 [11] top-level scope
    @ none:1
#+end_example

*** IMDB Reviews -- Text Classification/Regression

*** Ham or Spam -- Text Classification

** Concerns & Considerations

*** Compute resources -- environmental concerns

*** Bias

*** Personal information

- i.e. GANs reproducing exactly.

*** Mental health of optimisation algorithms

*** Copyright Concerns

Potential code laundering with github's copilot

* Summary

** What is Machine Learning

