2022-2023/Machine Learning/1.lecture-introductions.html

<div id="outline-container-org6d759f7" class="outline-4">
<h4 id="org6d759f7">Images/Videos</h4>
<div class="outline-text-4" id="text-org6d759f7">
<p>
Images are composed of 2D or 3D arrays of numeric values. For example, in a RGB
image that is 1024x500 pixels, we would have the array of size 1024x500x3 &#x2013; where 3
is the red, green, and blue channel, respectively. If we have just a grayscale image,
we could represent it as either 1024x500x1 or 1024x500 as the channel 'dimension' of
the array is singular.
</p>

<p>
We may already know that videos are simply a sequence of images that are iterated
through 24+ times a second. For a 24 frames per second video, we would have an array
size of 1024x500x3x24 &#x2013; a 4-dimensional array.
</p>
</div>
</div>

<div id="outline-container-orga97405c" class="outline-4">
<h4 id="orga97405c">Text</h4>
<div class="outline-text-4" id="text-orga97405c">
<ul class="org-ul">
<li>Composition of words</li>
<li>Can be in order, but doesn't have to be!</li>
<li>What is considered a word?</li>
</ul>
</div>
</div>

<div id="outline-container-orga426f7a" class="outline-4">
<h4 id="orga426f7a">Time-series</h4>
<div class="outline-text-4" id="text-orga426f7a">
<ul class="org-ul">
<li>Sequence of values (vector with a time component)</li>
<li>Example is a sound wave.</li>
</ul>
</div>
</div>

<div id="outline-container-org915e4eb" class="outline-4">
<h4 id="org915e4eb">Inputs/Outputs</h4>
<div class="outline-text-4" id="text-org915e4eb">
<p>
Within our data, each value will take on a certain type.
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-left">Example</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Discrete</td>
<td class="org-left">Total number of students</td>
</tr>

<tr>
<td class="org-left">Continuious</td>
<td class="org-left">Height of a student</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">Ordinal</td>
<td class="org-left">element of {Low, Med, High}</td>
</tr>

<tr>
<td class="org-left">Nominal</td>
<td class="org-left">element of {'dog', 'cat'}</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>Discrete:</li>
<li>Continuious:</li>
<li>Ordinal:</li>
<li>Nominal:</li>
</ul>
</div>
</div>

<div id="outline-container-org7869e5f" class="outline-4">
<h4 id="org7869e5f">Types of Outputs &#x2013; Regression &amp; Classification</h4>
<div class="outline-text-4" id="text-org7869e5f">
<ul class="org-ul">
<li>Regression - to continuious</li>
<li>Classification to discrete</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgbab7bb2" class="outline-3">
<h3 id="orgbab7bb2">Example Problems</h3>
<div class="outline-text-3" id="text-orgbab7bb2">
</div>
<div id="outline-container-orgf2e18f7" class="outline-4">
<h4 id="orgf2e18f7">Boston House Prices Dataset &#x2013; Tabular Regression</h4>
<div class="outline-text-4" id="text-orgf2e18f7">
<div class="org-src-container">
<pre class="src src-julia"><span style="color: #C678DD;">using</span> DataFrames
<span style="color: #C678DD;">using</span> MLDatasets: BostonHousing
dataset = BostonHousing();
dataset[1:5]
</pre>
</div>

<pre class="example" id="orgd005d96">
(features = 5×13 DataFrame
 Row │ CRIM     ZN       INDUS    CHAS   NOX      RM       AGE      DIS      RAD    TAX    PTRATIO  B        LSTAT   
     │ Float64  Float64  Float64  Int64  Float64  Float64  Float64  Float64  Int64  Int64  Float64  Float64  Float64 
─────┼────────────────────────────────────────────────────────────────────────────────────────────────────────────────
   1 │ 0.00632     18.0     2.31      0    0.538    6.575     65.2   4.09        1    296     15.3   396.9      4.98 
   2 │ 0.02731      0.0     7.07      0    0.469    6.421     78.9   4.9671      2    242     17.8   396.9      9.14
   3 │ 0.02729      0.0     7.07      0    0.469    7.185     61.1   4.9671      2    242     17.8   392.83     4.03
   4 │ 0.03237      0.0     2.18      0    0.458    6.998     45.8   6.0622      3    222     18.7   394.63     2.94
   5 │ 0.06905      0.0     2.18      0    0.458    7.147     54.2   6.0622      3    222     18.7   396.9      5.33 , targets = 5×1 DataFrame
 Row │ MEDV
     │ Float64
─────┼─────────
   1 │    24.0
   2 │    21.6
   3 │    34.7
   4 │    33.4
   5 │    36.2)
</pre>
</div>
</div>

<div id="outline-container-orgd0d04fe" class="outline-4">
<h4 id="orgd0d04fe">Iris Dataset &#x2013; Tabular Classification</h4>
<div class="outline-text-4" id="text-orgd0d04fe">
<div class="org-src-container">
<pre class="src src-julia"><span style="color: #C678DD;">using</span> MLDatasets: Iris
dataset = Iris();
dataset[1:5]
</pre>
</div>

<pre class="example" id="org94f1500">
(features = 5×4 DataFrame
 Row │ sepallength  sepalwidth  petallength  petalwidth
     │ Float64      Float64     Float64      Float64
─────┼──────────────────────────────────────────────────
   1 │         5.1         3.5          1.4         0.2
   2 │         4.9         3.0          1.4         0.2
   3 │         4.7         3.2          1.3         0.2
   4 │         4.6         3.1          1.5         0.2
   5 │         5.0         3.6          1.4         0.2, targets = 5×1 DataFrame
 Row │ class
     │ String15
─────┼─────────────
   1 │ Iris-setosa
   2 │ Iris-setosa
   3 │ Iris-setosa
   4 │ Iris-setosa
   5 │ Iris-setosa)
</pre>
</div>
</div>

<div id="outline-container-orge8c9243" class="outline-4">
<h4 id="orge8c9243">MNIST Dataset &#x2013; Image Classification</h4>
<div class="outline-text-4" id="text-orge8c9243">
<div class="org-src-container">
<pre class="src src-julia"><span style="color: #C678DD;">using</span> MLDatasets: MNIST
dataset = MNIST();
dataset[1:5]
</pre>
</div>

<pre class="example">
(features = [0.0 0.0 … 0.0 0.0; 0.0 0.0 … 0.0 0.0; … ; 0.0 0.0 … 0.0 0.0; 0.0 0.0 … 0.0 0.0;;; 0.0 0.0 … 0.0 0.0; 0.0 0.0 … 0.0 0.0; … ; 0.0 0.0 … 0.0 0.0; 0.0 0.0 … 0.0 0.0;;; 0.0 0.0 … 0.0 0.0; 0.0 0.0 … 0.0 0.0; … ; 0.0 0.0 … 0.0 0.0; 0.0 0.0 … 0.0 0.0;;; 0.0 0.0 … 0.0 0.0; 0.0 0.0 … 0.0 0.0; … ; 0.0 0.0 … 0.0 0.0; 0.0 0.0 … 0.0 0.0;;; 0.0 0.0 … 0.0 0.0; 0.0 0.0 … 0.0 0.0; … ; 0.0 0.0 … 0.0 0.0; 0.0 0.0 … 0.0 0.0], targets = [5, 0, 4, 1, 9])
</pre>
</div>
</div>

<div id="outline-container-orgf41a6e9" class="outline-4">
<h4 id="orgf41a6e9">MNIST Dataset &#x2013; Image Classification</h4>
<div class="outline-text-4" id="text-orgf41a6e9">
<div class="org-src-container">
<pre class="src src-julia"><span style="color: #C678DD;">using</span> Plots
p = heatmap(dataset[1].features', yflip=<span style="color: #56B6C2;">true</span>, colorbar=<span style="color: #56B6C2;">false</span>)
p = title!(<span style="color: #98C379;">"Label/Target: $(dataset[1].targets)"</span>)
savefig(p, <span style="color: #98C379;">"images/mnist-example.png"</span>)
</pre>
</div>

<pre class="example" id="org1c93a50">



ERROR: SystemError: opening file "/home/jaymorgan/Nextcloud/Teaching/images/mnist-example.png": Aucun fichier ou dossier de ce type
Stacktrace:
  [1] systemerror(p::String, errno::Int32; extrainfo::Nothing)
    @ Base ./error.jl:174
  [2] #systemerror#68
    @ ./error.jl:173 [inlined]
  [3] systemerror
    @ ./error.jl:173 [inlined]
  [4] open(fname::String; lock::Bool, read::Nothing, write::Nothing, create::Nothing, truncate::Bool, append::Nothing)
    @ Base ./iostream.jl:293
  [5] open(fname::String, mode::String; lock::Bool)
    @ Base ./iostream.jl:355
  [6] open(fname::String, mode::String)
    @ Base ./iostream.jl:355
  [7] open(::Plots.var"#277#278"{Plots.Plot{Plots.GRBackend}}, ::String, ::Vararg{String}; kwargs::Base.Pairs{Symbol, Union{}, Tuple{}, NamedTuple{(), Tuple{}}})
    @ Base ./io.jl:328
  [8] open
    @ ./io.jl:328 [inlined]
  [9] png(plt::Plots.Plot{Plots.GRBackend}, fn::String)
    @ Plots ~/.julia/packages/Plots/SkUg1/src/output.jl:4
 [10] savefig(plt::Plots.Plot{Plots.GRBackend}, fn::String)
    @ Plots ~/.julia/packages/Plots/SkUg1/src/output.jl:115
 [11] top-level scope
    @ none:1
</pre>
</div>
</div>

<div id="outline-container-org7e3a801" class="outline-4">
<h4 id="org7e3a801">IMDB Reviews &#x2013; Text Classification/Regression</h4>
</div>

<div id="outline-container-orga20ac77" class="outline-4">
<h4 id="orga20ac77">Ham or Spam &#x2013; Text Classification</h4>
</div>
</div>

<div id="outline-container-org71fd5fe" class="outline-3">
<h3 id="org71fd5fe">Concerns &amp; Considerations</h3>
<div class="outline-text-3" id="text-org71fd5fe">
</div>
<div id="outline-container-orgff5e368" class="outline-4">
<h4 id="orgff5e368">Compute resources &#x2013; environmental concerns</h4>
</div>

<div id="outline-container-org9d9506f" class="outline-4">
<h4 id="org9d9506f">Bias</h4>
</div>

<div id="outline-container-org1c2e639" class="outline-4">
<h4 id="org1c2e639">Personal information</h4>
<div class="outline-text-4" id="text-org1c2e639">
<ul class="org-ul">
<li>i.e. GANs reproducing exactly.</li>
</ul>
</div>
</div>

<div id="outline-container-orge5c4746" class="outline-4">
<h4 id="orge5c4746">Mental health of optimisation algorithms</h4>
</div>

<div id="outline-container-org8ee8763" class="outline-4">
<h4 id="org8ee8763">Copyright Concerns</h4>
<div class="outline-text-4" id="text-org8ee8763">
<p>
Potential code laundering with github's copilot
</p>
</div>
</div>
</div>
</div>

<div id="outline-container-orgb034a92" class="outline-2">
<h2 id="orgb034a92">Summary</h2>
<div class="outline-text-2" id="text-orgb034a92">
</div>
<div id="outline-container-org15eef45" class="outline-3">
<h3 id="org15eef45">What is Machine Learning</h3>
<div class="outline-text-3" id="text-org15eef45">
</div>
